---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.OccupancyUnit
source: html/9e3fe969-4e01-c33f-5aa1-8b6f263194ee.htm
---
# Autodesk.Revit.DB.Mechanical.OccupancyUnit

An enumerated type listing the occupancy unit of measure for a space object.

## Syntax (C#)
```csharp
public enum OccupancyUnit
```